Linux操作系统基础,Linux常用命令,文本编辑器Vim/Vi应用,Linux文件系统管理与维护,Linux用户和用户组管理,LANMP生产环境部署
XHTML技术核心	XHTML基础,XHTML标准,XHTML语法规则,表格布局,链接与图像,表单及相关元素
CSS2.0基础、CSS2.0 Box模型；CSS2.0 选择器；布局样式，文本样式，边框样式，背景样式，列表样式；CSS2.0 Hack


PHP工作原理，PHP语法结构；数据类型详解，数据类型转换；运算符及优先级，流程控制；数组；自定义函数，字符串函数库，数学函数库，数组函数库，日期时间函数库，函数函数库；文件上传及下载
MySQL基础	MySQL数据库基础；数据库的创建、修改及删除；数据类型详解；数据表的创建、修改及删除；无限分类的数据表设计；记录的插入、更新、删除及查找；外键与连接；索引
PHP核心函数库	MySQL函数库,分页技术的实现,,Apache URL Rewrite,GD函数库,Directory函数库,File函数库,RegExp函数库
PHP面向对象编程	类与对象，类的定义；属性与方法；$this关键字、 self关键字；继承，多态；魔术方法；抽象类与接口；设计模式；PDO类；JpGraph图表，FusionCharts图表

JS语法结构、数据类型详解、数据类型转换、变量；运算符及优先级，流程控制，数组，自定义函数；String对象，Math对象，Date对象，Array对象，Function对象，Object对象；W3C DOM及HTML DOM；XML，BOM，AJAX，JSON；JS面向对象编程，JS设计模式
jQuery框架	选择器、过滤器；属性处理，样式处理，文本处理，节点处理；事件委派，动画效果；插件体系
MySQL高级	存储过程，触发器，游标；事务处理；数据库引擎详解；数据库集群，数据库读写分离


Memcached缓存	Memcached缓存原理,内部结构,分散算法,PHP+Memcached应用	构建高性能的分布式的内存对象缓存系统
YII框架	安装YII；CURD；MVC架构;组件；控制器；动作、过滤器、校验器、路由;视图；部件；部件行为；部件事件；缓存

SEO基础	搜索引擎基础,网站结构设计基础,跟踪、监测,链接策略	掌握SEO技巧、操作，提高站点排名
负载均衡	DNS负载均衡,代理服务器负载均衡,NAT负载均衡,反向代理负载均衡	掌握网站的负载均衡技术，提高网站的高并发性能处理
网络安全	访问控制,检查安全漏洞,攻击监控,认证	构建安全的网站
缓存和静态化	文件缓存机制,部分缓存,文件组缓存,缓存生命周期	掌握文件缓存技术，根据项目需求构建性能良好的文件缓存系统
HTML5/CSS3	HTML5布局标记,音频处理；视频处理,本地存储,Canvas对象,CSS3选择器,颜色处理；背景处理；圆角处理；边框处理	灵活应用HTML5&CSS3
